{
  "_name_or_path": "ncfrey/ChemGPT-4.7M",
  "activation_function": "gelu_new",
  "architectures": [
    "GPTNeoForSequenceClassification"
  ],
  "attention_dropout": 0.0,
  "attention_layers": [
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local"
  ],
  "attention_types": [
    [
      [
        "global",
        "local"
      ],
      12
    ]
  ],
  "bos_token_id": 50256,
  "cache_path": "/data1/groups/ai4bio_shared/molecules/models/",
  "classifier_dropout": 0.1,
  "embed_dropout": 0.0,
  "eos_token_id": 50256,
  "gradient_checkpointing": false,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "layer_norm_epsilon": 1e-05,
  "max_length": 512,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neo",
  "num_heads": 16,
  "num_layers": 24,
  "resid_dropout": 0.0,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "use_cache": true,
  "vocab_size": 684,
  "window_size": 256
}
